hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_clc_regs.h
/*
 * Copyright (c) 2021-2026 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_CLC_H
#define HPM_CLC_H

typedef struct {
    struct {
        __RW uint32_t MODE;                    /* 0x0:  mode ctrl */
        __RW uint32_t ADC_EXPECT;              /* 0x4:  adc expect */
        __RW uint32_t ADC_CHAN;                /* 0x8:  adc used channel */
        __RW uint32_t ADC_OFFSET;              /* 0xC:  adc used offset */
        __RW uint32_t EADC_LOWTH;              /* 0x10:  eadc_lowth value used in error adc cofficient selection */
        __RW uint32_t EADC_HIGHTH;             /* 0x14:  eadc_highth value used in error adc cofficient selection */
        __RW uint32_t EADC_MIDLOWTH;           /* 0x18:  eadc_midlowth value used in error adc cofficient selection */
        __RW uint32_t EADC_MIDHIGHTH;          /* 0x1C:  eadc_midhighth value used in error adc cofficient selection */
        __RW uint32_t P2Z2_CLAMP_LO;           /* 0x20:  2p2z output clamp low threshold */
        __RW uint32_t P2Z2_CLAMP_HI;           /* 0x24:  2p2z output clamp high threshold */
        __RW uint32_t P3Z3_CLAMP_LO;           /* 0x28:  3p3z output clamp low threshold */
        __RW uint32_t P3Z3_CLAMP_HI;           /* 0x2C:  3p3z output clamp high threshold */
        __R  uint8_t  RESERVED0[16];           /* 0x30 - 0x3F: Reserved */
        struct {
            __RW uint32_t COEFF_B0;            /* 0x40:  zone  b0 */
            __RW uint32_t COEFF_B1;            /* 0x44:  zone  b1 */
            __RW uint32_t COEFF_B2;            /* 0x48:  zone  b2 */
            __RW uint32_t COEFF_B3;            /* 0x4C:  zone  b3 */
            __RW uint32_t COEFF_A0;            /* 0x50:  zone  a0 */
            __RW uint32_t COEFF_A1;            /* 0x54:  zone  a1 */
            __RW uint32_t COEFF_A2;            /* 0x58:  zone  a2 */
            __RW uint32_t COEFF_KS;            /* 0x5C:  zone  kscaling */
        } COEFF[3];
        __RW uint32_t PWM_PERIOD;              /* 0xA0:  pwm_period */
        __R  uint32_t OUTPUT_VALUE;            /* 0xA4:  output value */
        __R  uint32_t TIMESTAMP;               /* 0xA8:  adc timestamp used */
        __RW uint32_t EADC_CURR;               /* 0xAC:  error adc latest value */
        __RW uint32_t EADC_PRE0;               /* 0xB0:  error adc previous0 value */
        __RW uint32_t EADC_PRE1;               /* 0xB4:  error adc previous1 value */
        __RW uint32_t P2Z2_CURR;               /* 0xB8:  2p2z latest value */
        __RW uint32_t P2Z2_PRE0;               /* 0xBC:  2p2z previous0 value */
        __R  uint8_t  RESERVED1[4];            /* 0xC0 - 0xC3: Reserved */
        __RW uint32_t P3Z3_CURR;               /* 0xC4:  3p3z latest value */
        __R  uint8_t  RESERVED2[4];            /* 0xC8 - 0xCB: Reserved */
        __RW uint32_t P3Z3_FORBID_LO;          /* 0xCC:  3p3z output forbid low threshold */
        __RW uint32_t P3Z3_FORBID_MD;          /* 0xD0:  3p3z output forbid middle threshold */
        __RW uint32_t P3Z3_FORBID_HI;          /* 0xD4:  3p3z output forbid high threshold */
        __RW uint32_t LIND;                    /* 0xD8:  inductance used in decoupling */
        __RW uint32_t KE;                      /* 0xDC:  Ke used in decoupling */
        __RW uint32_t ADC_SW;                  /* 0xE0:  adc software inject value */
        __RW uint32_t SPEED_SW;                /* 0xE4:  speed software inject value */
        __RW uint32_t DECOUPLE_SCALING;        /* 0xE8:  decoupling scaling ratio */
        __R  uint8_t  RESERVED3[16];           /* 0xEC - 0xFB: Reserved */
        __W  uint32_t STATUS;                  /* 0xFC:  irq_status */
    } VDVQ_CHAN[2];
    __W  uint32_t DQ_ADC_SW_READY;             /* 0x200: enable d/q chan software inject adc value */
} CLC_Type;


/* Bitfield definition for register of struct array VDVQ_CHAN: MODE */
/*
 * ENABLE_CLC (RW)
 *
 * enable CLC
 */
#define CLC_VDVQ_CHAN_MODE_ENABLE_CLC_MASK (0x80000000UL)
#define CLC_VDVQ_CHAN_MODE_ENABLE_CLC_SHIFT (31U)
#define CLC_VDVQ_CHAN_MODE_ENABLE_CLC_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_MODE_ENABLE_CLC_SHIFT) & CLC_VDVQ_CHAN_MODE_ENABLE_CLC_MASK)
#define CLC_VDVQ_CHAN_MODE_ENABLE_CLC_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_MODE_ENABLE_CLC_MASK) >> CLC_VDVQ_CHAN_MODE_ENABLE_CLC_SHIFT)

/*
 * MASK_MODE (RW)
 *
 * open mode: CLC keep working even if bad irq status ocurred
 */
#define CLC_VDVQ_CHAN_MODE_MASK_MODE_MASK (0x1000000UL)
#define CLC_VDVQ_CHAN_MODE_MASK_MODE_SHIFT (24U)
#define CLC_VDVQ_CHAN_MODE_MASK_MODE_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_MODE_MASK_MODE_SHIFT) & CLC_VDVQ_CHAN_MODE_MASK_MODE_MASK)
#define CLC_VDVQ_CHAN_MODE_MASK_MODE_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_MODE_MASK_MODE_MASK) >> CLC_VDVQ_CHAN_MODE_MASK_MODE_SHIFT)

/*
 * DQ_MODE (RW)
 *
 * dq mode
 */
#define CLC_VDVQ_CHAN_MODE_DQ_MODE_MASK (0x10000UL)
#define CLC_VDVQ_CHAN_MODE_DQ_MODE_SHIFT (16U)
#define CLC_VDVQ_CHAN_MODE_DQ_MODE_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_MODE_DQ_MODE_SHIFT) & CLC_VDVQ_CHAN_MODE_DQ_MODE_MASK)
#define CLC_VDVQ_CHAN_MODE_DQ_MODE_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_MODE_DQ_MODE_MASK) >> CLC_VDVQ_CHAN_MODE_DQ_MODE_SHIFT)

/*
 * ENABLE_IRQ (RW)
 *
 * enable irq:
 * irq_data_in_forbid     , // 10
 * irq_forb_err_boundary  , // 9
 * irq_p3z3_over_lo       , // 8
 * irq_p3z3_over_hi       , // 7
 * irq_p3z3_err_boundary  , // 6
 * irq_z2_over_sf         , // 5
 * irq_z2_over_lo         , // 4
 * irq_z2_over_hi         , // 3
 * irq_z2_err_boundary    , // 2
 * irq_coef_err_boundary  , // 1
 * irq_valid_clc            // 0
 */
#define CLC_VDVQ_CHAN_MODE_ENABLE_IRQ_MASK (0x7FFU)
#define CLC_VDVQ_CHAN_MODE_ENABLE_IRQ_SHIFT (0U)
#define CLC_VDVQ_CHAN_MODE_ENABLE_IRQ_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_MODE_ENABLE_IRQ_SHIFT) & CLC_VDVQ_CHAN_MODE_ENABLE_IRQ_MASK)
#define CLC_VDVQ_CHAN_MODE_ENABLE_IRQ_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_MODE_ENABLE_IRQ_MASK) >> CLC_VDVQ_CHAN_MODE_ENABLE_IRQ_SHIFT)

/* Bitfield definition for register of struct array VDVQ_CHAN: ADC_EXPECT */
/*
 * ADC_EXPECT (RW)
 *
 * adc expect value
 */
#define CLC_VDVQ_CHAN_ADC_EXPECT_ADC_EXPECT_MASK (0xFFFFFFFFUL)
#define CLC_VDVQ_CHAN_ADC_EXPECT_ADC_EXPECT_SHIFT (0U)
#define CLC_VDVQ_CHAN_ADC_EXPECT_ADC_EXPECT_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_ADC_EXPECT_ADC_EXPECT_SHIFT) & CLC_VDVQ_CHAN_ADC_EXPECT_ADC_EXPECT_MASK)
#define CLC_VDVQ_CHAN_ADC_EXPECT_ADC_EXPECT_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_ADC_EXPECT_ADC_EXPECT_MASK) >> CLC_VDVQ_CHAN_ADC_EXPECT_ADC_EXPECT_SHIFT)

/* Bitfield definition for register of struct array VDVQ_CHAN: ADC_CHAN */
/*
 * ADC_CHAN (RW)
 *
 * adc used chan ID
 */
#define CLC_VDVQ_CHAN_ADC_CHAN_ADC_CHAN_MASK (0x1FU)
#define CLC_VDVQ_CHAN_ADC_CHAN_ADC_CHAN_SHIFT (0U)
#define CLC_VDVQ_CHAN_ADC_CHAN_ADC_CHAN_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_ADC_CHAN_ADC_CHAN_SHIFT) & CLC_VDVQ_CHAN_ADC_CHAN_ADC_CHAN_MASK)
#define CLC_VDVQ_CHAN_ADC_CHAN_ADC_CHAN_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_ADC_CHAN_ADC_CHAN_MASK) >> CLC_VDVQ_CHAN_ADC_CHAN_ADC_CHAN_SHIFT)

/* Bitfield definition for register of struct array VDVQ_CHAN: ADC_OFFSET */
/*
 * ADC_OFFSET (RW)
 *
 * adc used offset
 */
#define CLC_VDVQ_CHAN_ADC_OFFSET_ADC_OFFSET_MASK (0xFFFFFFFFUL)
#define CLC_VDVQ_CHAN_ADC_OFFSET_ADC_OFFSET_SHIFT (0U)
#define CLC_VDVQ_CHAN_ADC_OFFSET_ADC_OFFSET_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_ADC_OFFSET_ADC_OFFSET_SHIFT) & CLC_VDVQ_CHAN_ADC_OFFSET_ADC_OFFSET_MASK)
#define CLC_VDVQ_CHAN_ADC_OFFSET_ADC_OFFSET_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_ADC_OFFSET_ADC_OFFSET_MASK) >> CLC_VDVQ_CHAN_ADC_OFFSET_ADC_OFFSET_SHIFT)

/* Bitfield definition for register of struct array VDVQ_CHAN: EADC_LOWTH */
/*
 * EADC_LOWTH (RW)
 *
 * if error adc not bigger than eadc_lowth or not less than eadc_highth, use zone 2 cofficient；if not less than midlowth and not bigger than midhighth, use zone 0 cofficient；otherwire, use zone 1 cofficient
 */
#define CLC_VDVQ_CHAN_EADC_LOWTH_EADC_LOWTH_MASK (0xFFFFFFFFUL)
#define CLC_VDVQ_CHAN_EADC_LOWTH_EADC_LOWTH_SHIFT (0U)
#define CLC_VDVQ_CHAN_EADC_LOWTH_EADC_LOWTH_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_EADC_LOWTH_EADC_LOWTH_SHIFT) & CLC_VDVQ_CHAN_EADC_LOWTH_EADC_LOWTH_MASK)
#define CLC_VDVQ_CHAN_EADC_LOWTH_EADC_LOWTH_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_EADC_LOWTH_EADC_LOWTH_MASK) >> CLC_VDVQ_CHAN_EADC_LOWTH_EADC_LOWTH_SHIFT)

/* Bitfield definition for register of struct array VDVQ_CHAN: EADC_HIGHTH */
/*
 * EADC_HIGHTH (RW)
 *
 * if error adc not bigger than eadc_lowth or not less than eadc_highth, use zone 2 cofficient；if not less than midlowth and not bigger than midhighth, use zone 0 cofficient；otherwire, use zone 1 cofficient
 */
#define CLC_VDVQ_CHAN_EADC_HIGHTH_EADC_HIGHTH_MASK (0xFFFFFFFFUL)
#define CLC_VDVQ_CHAN_EADC_HIGHTH_EADC_HIGHTH_SHIFT (0U)
#define CLC_VDVQ_CHAN_EADC_HIGHTH_EADC_HIGHTH_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_EADC_HIGHTH_EADC_HIGHTH_SHIFT) & CLC_VDVQ_CHAN_EADC_HIGHTH_EADC_HIGHTH_MASK)
#define CLC_VDVQ_CHAN_EADC_HIGHTH_EADC_HIGHTH_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_EADC_HIGHTH_EADC_HIGHTH_MASK) >> CLC_VDVQ_CHAN_EADC_HIGHTH_EADC_HIGHTH_SHIFT)

/* Bitfield definition for register of struct array VDVQ_CHAN: EADC_MIDLOWTH */
/*
 * EADC_MIDLOWTH (RW)
 *
 * if error adc not bigger than eadc_lowth or not less than eadc_highth, use zone 2 cofficient；if not less than midlowth and not bigger than midhighth, use zone 0 cofficient；otherwire, use zone 1 cofficient
 */
#define CLC_VDVQ_CHAN_EADC_MIDLOWTH_EADC_MIDLOWTH_MASK (0xFFFFFFFFUL)
#define CLC_VDVQ_CHAN_EADC_MIDLOWTH_EADC_MIDLOWTH_SHIFT (0U)
#define CLC_VDVQ_CHAN_EADC_MIDLOWTH_EADC_MIDLOWTH_SET(x) (((uint32_t)(x) << CLC_VDVQ_CHAN_EADC_MIDLOWTH_EADC_MIDLOWTH_SHIFT) & CLC_VDVQ_CHAN_EADC_MIDLOWTH_EADC_MIDLOWTH_MASK)
#define CLC_VDVQ_CHAN_EADC_MIDLOWTH_EADC_MIDLOWTH_GET(x) (((uint32_t)(x) & CLC_VDVQ_CHAN_EADC_MIDLOWTH_EADC_MIDLOWTH_MASK) >> CLC_VDVQ_CHAN_EADC_MIDLOWTH_EADC_MIDLOWTH_SHIFT)

